#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого СтрокаСписка Из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.Сотрудник = СтрокаСписка.Сотрудник;
		Движение.Результат = СтрокаСписка.СуммаПремии;
	КонецЦикла;
	
	НаборыНачислений = Новый Массив;
	НаборыНачислений.Добавить(Движения.ВКМ_ДополнительныеНачисления);
	
	ВКМ_ЗарплатаСервер.СформироватьНДФЛ(Движения.ВКМ_Удержания, НаборыНачислений, ПериодРегистрации);
	ВКМ_ЗарплатаСервер.СформироватьВзаиморасчеты(Движения.ВКМ_ВзаиморасчетыССотрудниками,
		НаборыНачислений, Движения.ВКМ_Удержания, Дата);
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли