#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ВКМ Начало
	ВКМ_УстановитьВидимостьАбонентскихПолей();
	// ВКМ Конец
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ВКМ Начало
	ВКМ_УстановитьВидимостьАбонентскихПолей();
	// ВКМ Конец
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВКМ Начало
&НаСервере
Процедура ВКМ_УстановитьВидимостьАбонентскихПолей()
	
	ЭтоАбонентский = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Элементы.ВКМ_ДатаНачалаДействия.Видимость = ЭтоАбонентский;
	Элементы.ВКМ_ДатаОкончанияДействия.Видимость = ЭтоАбонентский;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонентский;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ЭтоАбонентский;
	
КонецПроцедуры
// ВКМ Конец

#КонецОбласти