
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
		УстановитьВидимостьАбонентскихПолей();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьАбонентскихПолей()
	
	ЭтоАбонентский = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Элементы.ВКМ_ДатаНачалаДействия.Видимость = ЭтоАбонентский;
	Элементы.ВКМ_ДатаОкончанияДействия.Видимость = ЭтоАбонентский;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонентский;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ЭтоАбонентский;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьАбонентскихПолей();
	
КонецПроцедуры